ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0h321x/SYSCTL_1.0.xml
    <register id="SYSCTL_FWEPROTMAIN" width="32" offset="0x3000" description="1 Sector Write-Erase per bit starting at address 0x0 of flash">
    </register>
    <register id="SYSCTL_FRXPROTMAINSTART" width="32" offset="0x3018" description="Flash RX Protection Start Address">
        <bitfield id="ADDR" description="Flash RX Protection Start Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FRXPROTMAINEND" width="32" offset="0x301C" description="Flash RX Protection End Address">
        <bitfield id="ADDR" description="Flash RX Protection End Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FIPPROTMAINSTART" width="32" offset="0x3020" description="Flash IP Protection Start Address">
        <bitfield id="ADDR" description="Flash IP Protection Start Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FIPPROTMAINEND" width="32" offset="0x3024" description="Flash IP Protection End Address">
        <bitfield id="ADDR" description="Flash IP Protection End Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FWENABLE" width="32" offset="0x3044" description="Security Firewall Enable Register">
        <bitfield id="FLIPPROT" description="1: Flash Read IP ProtectionActive" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ENABLE" value="0x1" description="Turn On Flash IP Protection"/>
        </bitfield>
        <bitfield id="SRAMBOUNDARYLOCK" description="1: Blocks Writes from Changing SRAMBOUNDARY MMR" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ENABLE" value="0x1" description="SRAMBOUNDARY MMR Locked"/>
        </bitfield>
        <bitfield id="FLRXPROT" description="1: Flash Read Execute Protection Active" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ENABLE" value="0x1" description="Turn On Flash Read-eXecute Protection"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SECSTATUS" width="32" offset="0x3048" description="Security Configuration  status">
        <bitfield id="FLIPPROT" description="1: Flash IP Protection Active" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description=""/>
            <bitenum id="ENABLED" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMBOUNDARYLOCK" description="1: SRAM Boundary MMR Locked" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description=""/>
            <bitenum id="ENABLED" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLRXPROT" description="1: Flash Read Execute Protection Active" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description=""/>
            <bitenum id="ENABLED" value="0x1" description=""/>
        </bitfield>
        <bitfield id="INITDONE" description="1: CSC has been completed" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NO" value="0x0" description="INIT is not yet done"/>
            <bitenum id="YES" value="0x1" description="INIT is done"/>
        </bitfield>
        <bitfield id="CSCEXISTS" description="1: CSC Exists in the system" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="NO" value="0x0" description="System does not have a CSC"/>
            <bitenum id="YES" value="0x1" description="System does have a CSC"/>
        </bitfield>
    </register>
    <register id="SYSCTL_INITDONE" width="32" offset="0x3060" description="INITCODE PASS">
        <bitfield id="PASS" description="INITCODE writes 1 for PASS, left unwritten a timeout will occur if not blocked" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="INITCODE PASS"/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B1MSPS0_PWREN" width="32" offset="0x4800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B1MSPS0_RSTCTL" width="32" offset="0x4804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B1MSPS0_CLKCFG" width="32" offset="0x4808" description="IP Clock Configuration Register">
        <bitfield id="CCONSTOP" description="Conversion Clock is ON during STOP Mode" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
        <bitfield id="CCONRUN" description="Conversion Clock is ON during RUN Mode" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SAMPCLK" description="Sample Window Clock" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="ULPCLK" value="0x0" description=""/>
            <bitenum id="SYSOSC" value="0x1" description=""/>
            <bitenum id="HFCLK" value="0x2" description=""/>
        </bitfield>
    </register>
